vlm/base/InformationRegisters/бит_ЗначенияПризнаковНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначенияПризнаковНоменклатуры</Name>
			<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>бит_Значение</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ПризнакиНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>бит_Номенклатура</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_Признак</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ПризнакиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_ПризнакСертификации</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/InformationRegisters/бит_ЗначенияПризнаковНоменклатуры/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 +
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("Номенклатура") Тогда
			Запись.бит_Номенклатура = Параметры.Отбор.Номенклатура;
		КонецЕсли;
	КонецЕсли; 
	
	Если Параметры.Свойство("Источник") Тогда
		Запись.бит_Номенклатура = Параметры.Источник;
	КонецЕсли;
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
КонецПроцедуры

&НаКлиенте
Процедура бит_ПризнакПриИзменении(Элемент)
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 +
	бит_ПризнакПриИзмененииНаСервере();
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
КонецПроцедуры 

&НаСервере
Процедура бит_ПризнакПриИзмененииНаСервере()
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 +
	Запись.бит_ПризнакСертификации = Запись.бит_Признак.бит_ПризнакСертификации;
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
КонецПроцедуры
